max-bot-cf/InformationRegisters/бестУслугиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУслугиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестЗначенияПлощадейНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЗначенияПлощадейНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестРасчетнаяТемператураВнутриПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРасчетнаяТемператураВнутриПомещения</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТемператураВнутриПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестНагрузкаПоУслугамНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНагрузкаПоУслугамНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыПериодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестОбъемыРаспределенияПотерь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестОбъемыРаспределенияПотерь</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемПотерь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/бестУчастиеОбъектовВРаспределенииРесурсовВМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУчастиеОбъектовВРаспределенииРесурсовВМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участвует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/CommonModules/бестРаботаСОбъектамиНПСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Действующие услуги по объекту
//
// Параметры:
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации  
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ДействующиеУслугиПоОбъекту(Период,Организация,Район,ОбъектРасчета) Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",				ОбъектРасчета);
	
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУслуги
	|ИЗ
	|	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета
	|					И ТочкаУчета В
	|						(ВЫБРАТЬ
	|							АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|						ИЗ
	|							АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|		ПО АктивныеТочкиУчетаОбъекта.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И АктивныеТочкиУчетаОбъекта.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	АктивныеТочкиУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА АктивныеТочкиУслуги.Услуга.СоставнаяУслуга
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ АктивныеТочкиУслуги.Услуга
	|	КОНЕЦ КАК Услуга
	|ИЗ
	|	АктивныеТочкиУслуги КАК АктивныеТочкиУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО АктивныеТочкиУслуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка";	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

// Функция - Действующие услуги по объекту с договорными объемами
//
// Параметры:
//  Период			 - Дата 
//  Организация		 - СправочникСсылка.Организации 
//  Район			 - СправочникСсылка.энргЗоныОтвественности 
//  ОбъектРасчета	 - СправочникСсылка.бестОбъектыРасчета 
// 
// Возвращаемое значение:
//   РезультатЗапроса 
//
Функция ДействующиеУслугиПоОбъектуСДоговорнымиОбъемами(Период,Организация,Район,ОбъектРасчета) Экспорт 
		
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("ОбъектРасчета",				ОбъектРасчета);
	
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаОбъекта
	|ИЗ
	|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ОбъектРасчета = &ОбъектРасчета) КАК бестАктивностьТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга,
	|	бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ АктивныеТочкиУслуги
	|ИЗ
	|	АктивныеТочкиУчетаОбъекта КАК АктивныеТочкиУчетаОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета
	|					И ТочкаУчета В
	|						(ВЫБРАТЬ
	|							АктивныеТочкиУчетаОбъекта.ТочкаУчета
	|						ИЗ
	|							АктивныеТочкиУчетаОбъекта)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|		ПО АктивныеТочкиУчетаОбъекта.ОбъектРасчета = бестУслугиТочекУчетаНПСрезПоследних.ОбъектРасчета
	|			И АктивныеТочкиУчетаОбъекта.ТочкаУчета = бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУслуги.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА АктивныеТочкиУслуги.Услуга.СоставнаяУслуга
	|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|		ИНАЧЕ АктивныеТочкиУслуги.Услуга
	|	КОНЕЦ КАК Услуга,
	|	АктивныеТочкиУслуги.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВТ_ТочкиИУслуги
	|ИЗ
	|	АктивныеТочкиУслуги КАК АктивныеТочкиУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО АктивныеТочкиУслуги.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(бестГарантированныеОбъемыСрезПоследних.Месяц, 1) КАК Месяц,
	|	ЕСТЬNULL(бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги, 0) КАК ОбъемУслуги,
	|	ВТ_ТочкиИУслуги.Услуга КАК Услуга
	|ИЗ
	|	ВТ_ТочкиИУслуги КАК ВТ_ТочкиИУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И ОбъектРасчета = &ОбъектРасчета) КАК бестГарантированныеОбъемыСрезПоследних
	|		ПО ВТ_ТочкиИУслуги.ОбъектРасчета = бестГарантированныеОбъемыСрезПоследних.ОбъектРасчета
	|			И ВТ_ТочкиИУслуги.Услуга = бестГарантированныеОбъемыСрезПоследних.Услуга
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_ТочкиИУслуги.Услуга.ИспользоватьРасчетРеактивнойЭнергии, ЛОЖЬ)";	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

// Функция - Распределенные значения потерь.
//
// Параметры:
//  Организация		 		  - СправочникСсылка.Организации 
//  Район			 		  - СправочникСсылка.энргЗоныОтвественности 
//  ГодДляРаспределения 	  - Дата
//  ГодовойОбъемПотерь 		  - Документы.бестЗаключениеДоговоровСЮридическимиЛицами.УслугиРаспределенияПотерь.ГодовойОбъемПотерь
//  СпособРаспределенияПотерь - Перечисления.бестСпособыРаспределенияПотерь
//
// Возвращаемое значение:
//	 ОбъемыПотерьПоМесяцам - Число
//
Функция РаспределенныеЗначенияПотерь(Организация,Район, ГодДляРаспределения, ГодовойОбъемПотерь, СпособРаспределенияПотерь) Экспорт
	
	ОбъемыПотерьПоМесяцам = Новый Структура();
	
	Если СпособРаспределенияПотерь = Перечисления.бестСпособыРаспределенияПотерь.Ежемесячно Тогда
		
		РаспределенныйОбъемПотерь = 0;
		
		Для Сч = 0 По 11 Цикл
			
			Если Сч = 11 Тогда
				ОбъемПотерь = ГодовойОбъемПотерь - РаспределенныйОбъемПотерь;
			Иначе
				ОбъемПотерь = ГодовойОбъемПотерь / 12;
			КонецЕсли;
			
			ДобавитьПериодВСтруктуру(Сч + 1, ОбъемПотерь,ОбъемыПотерьПоМесяцам);
			
			РаспределенныйОбъемПотерь = РаспределенныйОбъемПотерь + ОбъемПотерь;
			
		КонецЦикла;
		
	ИначеЕсли СпособРаспределенияПотерь = Перечисления.бестСпособыРаспределенияПотерь.ПоФакту Тогда
		
		Запрос = Новый Запрос;
		
		Текст = "ВЫБРАТЬ
		        |	ВложенныйЗапрос.Сезонность КАК Сезонность,
		        |	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодНачало - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцНачала - 1), ДЕНЬ, ВложенныйЗапрос.ДеньНачала - 1) КАК НачалоПериодаДействия,
		        |	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ВложенныйЗапрос.ГодОкончания - 1), МЕСЯЦ, ВложенныйЗапрос.МесяцОкончания - 1), ДЕНЬ, ВложенныйЗапрос.ДеньОкончания - 1) КАК КонецПериодаДействия
		        |ПОМЕСТИТЬ ОтопительныйПериод
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		энргДлительностиПериодов.Сезонность КАК Сезонность,
		        |		ВЫБОР
		        |			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
		        |				ТОГДА ДЕНЬ(&НачалоПериодаРасчета)
		        |		КОНЕЦ КАК ДеньНачала,
		        |		ВЫБОР
		        |			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
		        |				ТОГДА МЕСЯЦ(&НачалоПериодаРасчета)
		        |		КОНЕЦ КАК МесяцНачала,
		        |		ДЕНЬ(энргДлительностиПериодов.КонецПериода) КАК ДеньОкончания,
		        |		МЕСЯЦ(энргДлительностиПериодов.КонецПериода) КАК МесяцОкончания,
		        |		ГОД(&КонецПериодаРасчета) КАК ГодНачало,
		        |		ГОД(&КонецПериодаРасчета) КАК ГодОкончания
		        |	ИЗ
		        |		РегистрСведений.энргДлительностиПериодов.СрезПоследних(
		        |				&НачалоПериодаРасчета,
		        |				Организация = &Организация
		        |					И район = &район) КАК энргДлительностиПериодов
		        |	
		        |	ОБЪЕДИНИТЬ ВСЕ
		        |	
		        |	ВЫБРАТЬ
		        |		энргДлительностиПериодов.Сезонность,
		        |		ДЕНЬ(энргДлительностиПериодов.НачалоПериода),
		        |		МЕСЯЦ(энргДлительностиПериодов.НачалоПериода),
		        |		ВЫБОР
		        |			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
		        |				ТОГДА ДЕНЬ(&КонецПериодаРасчета)
		        |		КОНЕЦ,
		        |		ВЫБОР
		        |			КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
		        |				ТОГДА МЕСЯЦ(&КонецПериодаРасчета)
		        |		КОНЕЦ,
		        |		ГОД(&КонецПериодаРасчета),
		        |		ГОД(&КонецПериодаРасчета)
		        |	ИЗ
		        |		РегистрСведений.энргДлительностиПериодов.СрезПоследних(
		        |				&НачалоПериодаРасчета,
		        |				Организация = &Организация
		        |					И район = &район) КАК энргДлительностиПериодов) КАК ВложенныйЗапрос
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ОтопительныйПериод.Сезонность КАК Сезонность,
		        |	ОтопительныйПериод.НачалоПериодаДействия КАК НачалоПериодаДействия,
		        |	ОтопительныйПериод.КонецПериодаДействия КАК КонецПериодаДействия,
		        |	РАЗНОСТЬДАТ(ОтопительныйПериод.НачалоПериодаДействия, ОтопительныйПериод.КонецПериодаДействия, ДЕНЬ) + 1 КАК КоличествоДней
		        |ПОМЕСТИТЬ ОтопительныйПериодКоличествоДней
		        |ИЗ
		        |	ОтопительныйПериод КАК ОтопительныйПериод
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ОтопительныйПериодКоличествоДней.Сезонность КАК Сезонность,
		        |	СУММА(ОтопительныйПериодКоличествоДней.КоличествоДней) КАК КоличествоДней
		        |ПОМЕСТИТЬ СуммарноеКоличествоДней
		        |ИЗ
		        |	ОтопительныйПериодКоличествоДней КАК ОтопительныйПериодКоличествоДней
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ОтопительныйПериодКоличествоДней.Сезонность
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ОтопительныйПериодКоличествоДней.Сезонность КАК Сезонность,
		        |	ОтопительныйПериодКоличествоДней.НачалоПериодаДействия КАК НачалоПериодаДействия,
		        |	ОтопительныйПериодКоличествоДней.КонецПериодаДействия КАК КонецПериодаДействия,
		        |	СуммарноеКоличествоДней.КоличествоДней КАК СуммарноеКоличествоДней
		        |ИЗ
		        |	СуммарноеКоличествоДней КАК СуммарноеКоличествоДней
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтопительныйПериодКоличествоДней КАК ОтопительныйПериодКоличествоДней
		        |		ПО (ОтопительныйПериодКоличествоДней.Сезонность = СуммарноеКоличествоДней.Сезонность)";
		
		Запрос.Текст = Текст;
		
		Запрос.УстановитьПараметр("НачалоПериодаРасчета", Дата(ГодДляРаспределения, 1, 1));
		Запрос.УстановитьПараметр("КонецПериодаРасчета", Дата(ГодДляРаспределения, 12, 31));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Район", Район);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл

			Мес = НачалоМесяца(Выборка.НачалоПериодаДействия);
			Пока Мес <= Выборка.КонецПериодаДействия Цикл
				НачалоПериода = Макс(Выборка.НачалоПериодаДействия,Мес);
				КонецПериода = Мин(Выборка.КонецПериодаДействия,КонецМесяца(Мес));
				Мес = ДобавитьМесяц(Мес, 1);
				КоличествоДней = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / (60 * 60 * 24) + 1;
				ОбъемПотерь = КоличествоДней/ Выборка.СуммарноеКоличествоДней * ГодовойОбъемПотерь;
				ДобавитьПериодВСтруктуру(Месяц(КонецПериода), ОбъемПотерь,ОбъемыПотерьПоМесяцам);

			КонецЦикла;     
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОбъемыПотерьПоМесяцам;	
	
КонецФункции

// Функция - Заполнить текст информации объекта
//
// Параметры:
//	 ТекСтрока - Справочники.бестОбъектыРасчета.НазначениеНП
//
// Возвращаемое значение:
//	 СокрЛП - Строка
Функция ЗаполнитьТекстИнформацииОбъекта(ТекСтрока) Экспорт
	Текст = "Назначение: " + ТекСтрока.НазначениеНП + Символы.ПС;
	Текст = Текст + "Колво раб дней: " + ТекСтрока.КоличествоРабочихДней + Символы.ПС;	
	Текст = Текст + "Колво раб часов: " + ТекСтрока.КоличествоРабочихЧасовВДень + Символы.ПС;
	Возврат СокрЛП(Текст);
КонецФункции

// Процедура - Проверить и создать объекты расчета.
//
// Параметры:
//  ТекущийОбъект	 - ФормаКлиентскогоПриложения 
//  ИмяКоллекции	 - Строка 
//
Процедура ПроверитьИСоздатьОбъектыРасчета(ТекущийОбъект,ИмяКоллекции) Экспорт 
	
	НовыеОбъектыРасчета 						= Новый Массив;
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеОбъектыРасчета") Тогда
		НовыеОбъектыРасчета 						= ТекущийОбъект.ДополнительныеСвойства.НовыеОбъектыРасчета; 
	КонецЕсли;
	
	для Каждого стр из ТекущийОбъект[ИмяКоллекции] цикл
			
		ДанныеОбъекта 			= ДанныеОбъектаИзСтрокиJSON(стр.ОписаниеОбъекта);
		
		Если ДанныеОбъекта.Свойство("АдресОбъектаЗначение") И ЗначениеЗаполнено(ДанныеОбъекта.АдресОбъектаЗначение) Тогда
			Чтение  			= Новый ЧтениеJSON();
			Чтение.УстановитьСтроку(ДанныеОбъекта.АдресОбъектаЗначение);
			ДанныеАдреса		= ПрочитатьJSON(Чтение);
		КонецЕсли;
		
		Если НЕ НовыеОбъектыРасчета.Найти(стр.НомерСтроки) = Неопределено Тогда
			ОбъектРасчетаОбъект 					= Справочники.бестОбъектыРасчета.СоздатьЭлемент();
		    ОбъектРасчетаОбъект.УстановитьСсылкуНового(стр.ОбъектРасчета);
		Иначе
			ОбъектРасчетаОбъект  					= стр.ОбъектРасчета.получитьОбъект();
		КонецЕсли;
		
		ЗаполнитьРеквизитыОбъектаРасчета(ОбъектРасчетаОбъект,ДанныеОбъекта);
			 
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Прочитать данные объекта.
//
// Параметры:
//	Форма 		 - ФормаКлиентскогоПриложения
//	ИмяКоллекции - Строка
//
Процедура ПрочитатьДанныеОбъекта(Форма, ИмяКоллекции) Экспорт 
	
	Коллекция 				= Форма.Объект[ИмяКоллекции];
	Запрос 					= Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеТабЧасти",Коллекция.Выгрузить()); 
	Запрос.Текст 			= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|	ДанныеТабЧасти.ОбъектРасчета КАК ОбъектРасчета
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|ГДЕ
	|	НЕ ДанныеТабЧасти.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК АдресОбъекта,
	|	бестОбъектыРасчетаКонтактнаяИнформация.ЗначенияПолей КАК АдресОбъектаПредставлениеПолей,
	|	ВложенныйЗапрос.Наименование КАК НаименованиеОбъектаРасчета,
	|	ВложенныйЗапрос.НазначениеНП КАК НазначениеНП,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ОбъектРасчета КАК ОбъектРасчета,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.КатегорияОбъекта КАК КатегорияОбъекта,
	|	ВложенныйЗапрос.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	ВложенныйЗапрос.Помещение КАК Помещение,
	|	ВложенныйЗапрос.Контролер КАК Контролер,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НаружныйОбъемЗдания КАК НаружныйОбъемЗдания
	|ИЗ
	|	(ВЫБРАТЬ
	|		бестОбъектыРасчета.Наименование КАК Наименование,
	|		бестОбъектыРасчета.НазначениеНП КАК НазначениеНП,
	|		бестОбъектыРасчета.МКД КАК МКД,
	|		ДанныеТабЧасти.ОбъектРасчета КАК ОбъектРасчета,
	|		ДанныеТабЧасти.НомерСтроки КАК НомерСтроки,
	|		бестОбъектыРасчета.КатегорияПомещения КАК КатегорияОбъекта,
	|		бестОбъектыРасчета.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|		бестОбъектыРасчета.Помещение КАК Помещение,
	|		бестОбъектыРасчета.Контролер КАК Контролер,
	|		бестОбъектыРасчета.Организация КАК Организация,
	|		бестОбъектыРасчета.НаружныйОбъемЗдания КАК НаружныйОбъемЗдания
	|	ИЗ
	|		ДанныеТабЧасти КАК ДанныеТабЧасти
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|			ПО ДанныеТабЧасти.ОбъектРасчета = бестОбъектыРасчета.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО ВложенныйЗапрос.ОбъектРасчета = бестОбъектыРасчетаКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	бестОбъектыРасчетаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И бестОбъектыРасчетаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресОбъектаРасчета)";
	
	Результат  									= Запрос.Выполнить();
	Выборка 									= Результат.Выбрать();
	                       	
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения 					= Коллекция[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка,,"НомерСтроки");
	КонецЦикла;
	
	Для Каждого СтрокаТочки Из Коллекция Цикл
		//Если ЗначениеЗаполнено(СтрокаТочки.ОбъектРасчета) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТочки.ОписаниеОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		Чтение 									= Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(СтрокаТочки.ОписаниеОбъекта);
		ОписаниеОбъекта						= ПрочитатьJSON(Чтение);
		Для Каждого КлючЗначение Из ОписаниеОбъекта Цикл
			Если КлючЗначение.Ключ = "Наименование" Тогда
				СтрокаТочки.НаименованиеОбъектаРасчета = КлючЗначение.Значение;  
			ИначеЕсли КлючЗначение.Ключ = "НазначениеНП" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.бестНазначениеНежилогоПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "ГруппаОбъектовРасчета" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.бестГруппыОбъектовРасчета.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));	
			ИначеЕсли КлючЗначение.Ключ = "ГруппаПотребителей" Тогда
				//СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.бестГруппыОбъектовРасчета.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));	
			ИначеЕсли КлючЗначение.Ключ = "КатегорияОбъекта" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргКатегорииПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));	
			ИначеЕсли КлючЗначение.Ключ = "МКД" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "Контролер" Тогда
				СтрокаТочки[КлючЗначение.Ключ] 	= Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Значение));
			ИначеЕсли КлючЗначение.Ключ = "Организация" ИЛИ КлючЗначение.Ключ = "Помещение" ИЛИ КлючЗначение.Ключ = "Договор" Тогда
				Продолжить;
			Иначе
				СтрокаТочки[КлючЗначение.Ключ] 	= КлючЗначение.Значение;        
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;	
	
КонецПроцедуры

// Функция - Получить информацию по объекту.
//
// Параметры:
//	ОбъектРасчета - СправочникСсылка.бестОбъектыРасчета - объект расчета
//
// Возвращаемое значение:
//	СтруктураРезультат - Структура
//
Функция ПолучитьИнформациюПоОбъекту(ОбъектРасчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестОбъектыРасчета.НазначениеНП КАК НазначениеНП,
	|	бестОбъектыРасчета.МКД КАК МКД,
	|	бестОбъектыРасчета.Ссылка КАК Ссылка,
	|	бестОбъектыРасчета.КатегорияПомещения КАК КатегорияОбъекта,
	|	бестОбъектыРасчета.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	ВЫРАЗИТЬ(бестОбъектыРасчетаКонтактнаяИнформация.Представление КАК СТРОКА(300)) КАК АдресОбъекта,
	|	бестОбъектыРасчетаКонтактнаяИнформация.ЗначенияПолей КАК АдресОбъектаЗначение,
	|	бестОбъектыРасчета.Контролер КАК Контролер,
	|	бестОбъектыРасчета.Наименование КАК Наименование,
	|	бестОбъектыРасчета.Помещение КАК Помещение,
	|	бестОбъектыРасчета.Организация КАК Организация,
	|	бестОбъектыРасчета.НаружныйОбъемЗдания КАК НаружныйОбъемЗдания
	|ПОМЕСТИТЬ ВТ_Объект
	|ИЗ
	|	Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета.КонтактнаяИнформация КАК бестОбъектыРасчетаКонтактнаяИнформация
	|		ПО (бестОбъектыРасчетаКонтактнаяИнформация.Ссылка = бестОбъектыРасчета.Ссылка)
	|ГДЕ
	|	бестОбъектыРасчета.Ссылка = &ОбъектРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестЗначенияПлощадейНПСрезПоследних.Период КАК Период,
	|	бестЗначенияПлощадейНПСрезПоследних.Регистратор КАК Регистратор,
	|	бестЗначенияПлощадейНПСрезПоследних.Площадь КАК Площадь
	|ПОМЕСТИТЬ ВТ_ВсеЗаписиПлощади
	|ИЗ
	|	РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|					(ВЫБРАТЬ
	|						ВТ.Ссылка
	|					ИЗ
	|						ВТ_Объект КАК ВТ)
	|				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)) КАК бестЗначенияПлощадейНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиПлощади.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксПлощадь
	|ИЗ
	|	ВТ_ВсеЗаписиПлощади КАК ВТ_ВсеЗаписиПлощади
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиПлощади.Регистратор) КАК Регистратор,
	|	ВТ_ВсеЗаписиПлощади.Период КАК Период
	|ПОМЕСТИТЬ ВТ_МаксРегистраторПлощадь
	|ИЗ
	|	ВТ_МаксПлощадь КАК ВТ_МаксПлощадь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеЗаписиПлощади КАК ВТ_ВсеЗаписиПлощади
	|		ПО ВТ_МаксПлощадь.Период = ВТ_ВсеЗаписиПлощади.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиПлощади.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиПлощади.Площадь КАК Площадь
	|ПОМЕСТИТЬ ВТ_Площадь
	|ИЗ
	|	ВТ_ВсеЗаписиПлощади КАК ВТ_ВсеЗаписиПлощади
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистраторПлощадь КАК ВТ_МаксРегистраторПлощадь
	|		ПО ВТ_ВсеЗаписиПлощади.Период = ВТ_МаксРегистраторПлощадь.Период
	|			И ВТ_ВсеЗаписиПлощади.Регистратор = ВТ_МаксРегистраторПлощадь.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетнаяТемператураВнутриПомещенияСрезПоследних.Период КАК Период,
	|	бестРасчетнаяТемператураВнутриПомещенияСрезПоследних.Регистратор КАК Регистратор,
	|	бестРасчетнаяТемператураВнутриПомещенияСрезПоследних.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ ВТ_ВсеЗаписиТемпературы
	|ИЗ
	|	РегистрСведений.бестРасчетнаяТемператураВнутриПомещения.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестРасчетнаяТемператураВнутриПомещенияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиТемпературы.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксПериодТемпературы
	|ИЗ
	|	ВТ_ВсеЗаписиТемпературы КАК ВТ_ВсеЗаписиТемпературы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиТемпературы.Регистратор) КАК Регистратор,
	|	ВТ_ВсеЗаписиТемпературы.Период КАК Период
	|ПОМЕСТИТЬ ВТ_МаксРегистраторТемпературы
	|ИЗ
	|	ВТ_МаксПериодТемпературы КАК ВТ_МаксПериодТемпературы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеЗаписиТемпературы КАК ВТ_ВсеЗаписиТемпературы
	|		ПО ВТ_МаксПериодТемпературы.Период = ВТ_ВсеЗаписиТемпературы.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиТемпературы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиТемпературы.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения
	|ПОМЕСТИТЬ ВТ_Температура
	|ИЗ
	|	ВТ_ВсеЗаписиТемпературы КАК ВТ_ВсеЗаписиТемпературы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистраторТемпературы КАК ВТ_МаксРегистраторТемпературы
	|		ПО ВТ_ВсеЗаписиТемпературы.Период = ВТ_МаксРегистраторТемпературы.Период
	|			И ВТ_ВсеЗаписиТемпературы.Регистратор = ВТ_МаксРегистраторТемпературы.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестНагрузкаПоУслугамНПСрезПоследних.Период КАК Период,
	|	бестНагрузкаПоУслугамНПСрезПоследних.Регистратор КАК Регистратор,
	|	бестНагрузкаПоУслугамНПСрезПоследних.Услуга КАК Услуга,
	|	бестНагрузкаПоУслугамНПСрезПоследних.Нагрузка КАК Нагрузка
	|ПОМЕСТИТЬ ВТ_ВсеЗаписи
	|ИЗ
	|	РегистрСведений.бестНагрузкаПоУслугамНП.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестНагрузкаПоУслугамНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписи.Период) КАК Период,
	|	ВТ_ВсеЗаписи.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_МаксПериод
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписи.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксПериод.Период КАК Период,
	|	ВТ_МаксПериод.Услуга КАК Услуга,
	|	МАКСИМУМ(ВТ_ВсеЗаписи.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_МаксРегистратор
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериод КАК ВТ_МаксПериод
	|		ПО ВТ_ВсеЗаписи.Период = ВТ_МаксПериод.Период
	|			И ВТ_ВсеЗаписи.Услуга = ВТ_МаксПериод.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МаксПериод.Период,
	|	ВТ_МаксПериод.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестТарифныеКатегорииНПСрезПоследних.Период КАК Период,
	|	бестТарифныеКатегорииНПСрезПоследних.Регистратор КАК Регистратор,
	|	бестТарифныеКатегорииНПСрезПоследних.Услуга КАК Услуга,
	|	бестТарифныеКатегорииНПСрезПоследних.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ПОМЕСТИТЬ ВТ_ТарифныеКатегории_ВсеЗаписи
	|ИЗ
	|	РегистрСведений.бестТарифныеКатегорииНП.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестТарифныеКатегорииНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ТарифныеКатегории_ВсеЗаписи.Период) КАК Период,
	|	ВТ_ТарифныеКатегории_ВсеЗаписи.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_МаксПериод_ТарифныеКатегории
	|ИЗ
	|	ВТ_ТарифныеКатегории_ВсеЗаписи КАК ВТ_ТарифныеКатегории_ВсеЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТарифныеКатегории_ВсеЗаписи.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксПериод_ТарифныеКатегории.Период КАК Период,
	|	ВТ_МаксПериод_ТарифныеКатегории.Услуга КАК Услуга,
	|	МАКСИМУМ(ВТ_ТарифныеКатегории_ВсеЗаписи.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_МаксРегистратор_ТарифныеКатегории
	|ИЗ
	|	ВТ_ТарифныеКатегории_ВсеЗаписи КАК ВТ_ТарифныеКатегории_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериод_ТарифныеКатегории КАК ВТ_МаксПериод_ТарифныеКатегории
	|		ПО ВТ_ТарифныеКатегории_ВсеЗаписи.Период = ВТ_МаксПериод_ТарифныеКатегории.Период
	|			И ВТ_ТарифныеКатегории_ВсеЗаписи.Услуга = ВТ_МаксПериод_ТарифныеКатегории.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МаксПериод_ТарифныеКатегории.Период,
	|	ВТ_МаксПериод_ТарифныеКатегории.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПотребителиГВССрезПоследних.Период КАК Период,
	|	бестПотребителиГВССрезПоследних.Регистратор КАК Регистратор,
	|	бестПотребителиГВССрезПоследних.Тип КАК Тип,
	|	бестПотребителиГВССрезПоследних.Количество КАК Количество,
	|	бестПотребителиГВССрезПоследних.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
	|	бестПотребителиГВССрезПоследних.ТипНормы КАК ТипНормы
	|ПОМЕСТИТЬ Вт_ВсеПотребителейГВС
	|ИЗ
	|	РегистрСведений.бестПотребителиГВС.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестПотребителиГВССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Вт_ВсеПотребителейГВС.Период) КАК Период,
	|	Вт_ВсеПотребителейГВС.Тип КАК Тип
	|ПОМЕСТИТЬ ВТ_МаксПериодПотребителейГВС
	|ИЗ
	|	Вт_ВсеПотребителейГВС КАК Вт_ВсеПотребителейГВС
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_ВсеПотребителейГВС.Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Вт_ВсеПотребителейГВС.Регистратор) КАК Регистратор,
	|	Вт_ВсеПотребителейГВС.Тип КАК Тип,
	|	Вт_ВсеПотребителейГВС.Период КАК Период
	|ПОМЕСТИТЬ ВТ_МаксРегистраторПотребителейГВС
	|ИЗ
	|	Вт_ВсеПотребителейГВС КАК Вт_ВсеПотребителейГВС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериодПотребителейГВС КАК ВТ_МаксПериодПотребителейГВС
	|		ПО Вт_ВсеПотребителейГВС.Период = ВТ_МаксПериодПотребителейГВС.Период
	|			И Вт_ВсеПотребителейГВС.Тип = ВТ_МаксПериодПотребителейГВС.Тип
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт_ВсеПотребителейГВС.Тип,
	|	Вт_ВсеПотребителейГВС.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестГарантированныеОбъемыСрезПоследних.Период КАК Период,
	|	бестГарантированныеОбъемыСрезПоследних.Регистратор КАК Регистратор,
	|	бестГарантированныеОбъемыСрезПоследних.Услуга КАК Услуга,
	|	бестГарантированныеОбъемыСрезПоследних.Месяц КАК Месяц,
	|	бестГарантированныеОбъемыСрезПоследних.ОбъемУслуги КАК ОбъемУслуги,
	|	бестГарантированныеОбъемыСрезПоследних.Год КАК Год
	|ПОМЕСТИТЬ ВТ_ВсеЗаписиОбъемов
	|ИЗ
	|	РегистрСведений.бестГарантированныеОбъемы.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестГарантированныеОбъемыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиОбъемов.Период) КАК Период,
	|	ВТ_ВсеЗаписиОбъемов.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемов.Месяц КАК Месяц
	|ПОМЕСТИТЬ ВТ_МаксПериодОбъемов
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемов КАК ВТ_ВсеЗаписиОбъемов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиОбъемов.Услуга,
	|	ВТ_ВсеЗаписиОбъемов.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиОбъемов.Период КАК Период,
	|	МАКСИМУМ(ВТ_ВсеЗаписиОбъемов.Регистратор) КАК Регистратор,
	|	ВТ_ВсеЗаписиОбъемов.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемов.Месяц КАК Месяц
	|ПОМЕСТИТЬ ВТ_МаксРегистраторОбъемов
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемов КАК ВТ_ВсеЗаписиОбъемов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериодОбъемов КАК ВТ_МаксПериодОбъемов
	|		ПО ВТ_ВсеЗаписиОбъемов.Период = ВТ_МаксПериодОбъемов.Период
	|			И ВТ_ВсеЗаписиОбъемов.Услуга = ВТ_МаксПериодОбъемов.Услуга
	|			И ВТ_ВсеЗаписиОбъемов.Месяц = ВТ_МаксПериодОбъемов.Месяц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиОбъемов.Период,
	|	ВТ_ВсеЗаписиОбъемов.Услуга,
	|	ВТ_ВсеЗаписиОбъемов.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестОбъемыРаспределенияПотерьСрезПоследних.Период КАК Период,
	|	бестОбъемыРаспределенияПотерьСрезПоследних.Регистратор КАК Регистратор,
	|	бестОбъемыРаспределенияПотерьСрезПоследних.Услуга КАК Услуга,
	|	бестОбъемыРаспределенияПотерьСрезПоследних.Месяц КАК Месяц,
	|	бестОбъемыРаспределенияПотерьСрезПоследних.ОбъемПотерь КАК ОбъемПотерь
	|ПОМЕСТИТЬ ВТ_ВсеЗаписиОбъемовПотерь
	|ИЗ
	|	РегистрСведений.бестОбъемыРаспределенияПотерь.СрезПоследних(
	|			,
	|			ОбъектРасчета В
	|				(ВЫБРАТЬ
	|					ВТ.Ссылка
	|				ИЗ
	|					ВТ_Объект КАК ВТ)) КАК бестОбъемыРаспределенияПотерьСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписиОбъемовПотерь.Период) КАК Период,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Месяц КАК Месяц
	|ПОМЕСТИТЬ ВТ_МаксПериодОбъемовПотерь
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемовПотерь КАК ВТ_ВсеЗаписиОбъемовПотерь
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиОбъемовПотерь.Услуга,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиОбъемовПотерь.Период КАК Период,
	|	МАКСИМУМ(ВТ_ВсеЗаписиОбъемовПотерь.Регистратор) КАК Регистратор,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Месяц КАК Месяц
	|ПОМЕСТИТЬ ВТ_МаксРегистраторОбъемовПотерь
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемовПотерь КАК ВТ_ВсеЗаписиОбъемовПотерь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксПериодОбъемовПотерь КАК ВТ_МаксПериодОбъемовПотерь
	|		ПО ВТ_ВсеЗаписиОбъемовПотерь.Период = ВТ_МаксПериодОбъемовПотерь.Период
	|			И ВТ_ВсеЗаписиОбъемовПотерь.Услуга = ВТ_МаксПериодОбъемовПотерь.Услуга
	|			И ВТ_ВсеЗаписиОбъемовПотерь.Месяц = ВТ_МаксПериодОбъемовПотерь.Месяц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписиОбъемовПотерь.Период,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Услуга,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТарифныеКатегории_ВсеЗаписи.Услуга КАК Услуга,
	|	ВТ_ТарифныеКатегории_ВсеЗаписи.ТарифнаяКатегория КАК ТарифнаяКатегория
	|ИЗ
	|	ВТ_ТарифныеКатегории_ВсеЗаписи КАК ВТ_ТарифныеКатегории_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистратор_ТарифныеКатегории КАК ВТ_МаксРегистратор_ТарифныеКатегории
	|		ПО ВТ_ТарифныеКатегории_ВсеЗаписи.Период = ВТ_МаксРегистратор_ТарифныеКатегории.Период
	|			И ВТ_ТарифныеКатегории_ВсеЗаписи.Услуга = ВТ_МаксРегистратор_ТарифныеКатегории.Услуга
	|			И ВТ_ТарифныеКатегории_ВсеЗаписи.Регистратор = ВТ_МаксРегистратор_ТарифныеКатегории.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиОбъемовПотерь.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемовПотерь.Месяц КАК Месяц,
	|	ГОД(ВТ_ВсеЗаписиОбъемовПотерь.Месяц) КАК Год,
	|	МЕСЯЦ(ВТ_ВсеЗаписиОбъемовПотерь.Месяц) КАК МесяцЧислом,
	|	ВТ_ВсеЗаписиОбъемовПотерь.ОбъемПотерь КАК ОбъемПотерь
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемовПотерь КАК ВТ_ВсеЗаписиОбъемовПотерь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистраторОбъемовПотерь КАК ВТ_МаксРегистраторОбъемовПотерь
	|		ПО ВТ_ВсеЗаписиОбъемовПотерь.Период = ВТ_МаксРегистраторОбъемовПотерь.Период
	|			И ВТ_ВсеЗаписиОбъемовПотерь.Регистратор = ВТ_МаксРегистраторОбъемовПотерь.Регистратор
	|			И ВТ_ВсеЗаписиОбъемовПотерь.Услуга = ВТ_МаксРегистраторОбъемовПотерь.Услуга
	|			И ВТ_ВсеЗаписиОбъемовПотерь.Месяц = ВТ_МаксРегистраторОбъемовПотерь.Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	Год,
	|	МесяцЧислом
	|ИТОГИ ПО
	|	Услуга,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объект.Ссылка КАК ОбъектРасчета,
	|	ВТ_Объект.Наименование КАК НаименованиеОбъектаРасчета,
	|	ВТ_Объект.МКД КАК МКД,
	|	ВТ_Объект.НазначениеНП КАК НазначениеНП,
	|	ВТ_Площадь.Площадь КАК Площадь,
	|	бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.Участвует КАК Участвует,
	|	ВТ_Температура.ТемператураВнутриПомещения КАК ТемператураВнутриПомещения,
	|	ВТ_Объект.КатегорияОбъекта КАК КатегорияОбъекта,
	|	ВТ_Объект.ГруппаОбъектовРасчета КАК ГруппаПотребителей,
	|	ВТ_Объект.АдресОбъекта КАК АдресОбъекта,
	|	ВТ_Объект.АдресОбъектаЗначение КАК АдресОбъектаЗначение,
	|	ВТ_Объект.Контролер КАК Контролер,
	|	ВТ_Объект.Помещение КАК Помещение,
	|	ВТ_Объект.Организация КАК Организация,
	|	ВТ_Объект.ГруппаОбъектовРасчета КАК ГруппаОбъектовРасчета,
	|	ВТ_Объект.НаружныйОбъемЗдания КАК НаружныйОбъемЗдания
	|ИЗ
	|	ВТ_Объект КАК ВТ_Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестУчастиеОбъектовВРаспределенииРесурсовВМКД.СрезПоследних(
	|				,
	|				ОбъектРасчета В
	|					(ВЫБРАТЬ
	|						ВТ.Ссылка
	|					ИЗ
	|						ВТ_Объект КАК ВТ)) КАК бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних
	|		ПО ВТ_Объект.Ссылка = бестУчастиеОбъектовВРаспределенииРесурсовВМКДСрезПоследних.ОбъектРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Площадь КАК ВТ_Площадь
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Температура КАК ВТ_Температура
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписи.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписи.Нагрузка КАК Нагрузка
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистратор КАК ВТ_МаксРегистратор
	|		ПО ВТ_ВсеЗаписи.Период = ВТ_МаксРегистратор.Период
	|			И ВТ_ВсеЗаписи.Услуга = ВТ_МаксРегистратор.Услуга
	|			И ВТ_ВсеЗаписи.Регистратор = ВТ_МаксРегистратор.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт_ВсеПотребителейГВС.Тип КАК Тип,
	|	Вт_ВсеПотребителейГВС.Количество КАК Количество,
	|	Вт_ВсеПотребителейГВС.КоличествоРабочихЧасовВДень КАК КоличествоРабочихЧасовВДень,
	|	Вт_ВсеПотребителейГВС.ТипНормы КАК ТипНормы
	|ИЗ
	|	Вт_ВсеПотребителейГВС КАК Вт_ВсеПотребителейГВС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистраторПотребителейГВС КАК ВТ_МаксРегистраторПотребителейГВС
	|		ПО Вт_ВсеПотребителейГВС.Период = ВТ_МаксРегистраторПотребителейГВС.Период
	|			И Вт_ВсеПотребителейГВС.Регистратор = ВТ_МаксРегистраторПотребителейГВС.Регистратор
	|			И Вт_ВсеПотребителейГВС.Тип = ВТ_МаксРегистраторПотребителейГВС.Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписиОбъемов.Услуга КАК Услуга,
	|	ВТ_ВсеЗаписиОбъемов.Месяц КАК Месяц,
	|	ВТ_ВсеЗаписиОбъемов.ОбъемУслуги КАК ОбъемУслуги,
	|	ВТ_ВсеЗаписиОбъемов.Год КАК Год,
	|	ВТ_ВсеЗаписиОбъемов.Месяц КАК МесяцЧислом
	|ИЗ
	|	ВТ_ВсеЗаписиОбъемов КАК ВТ_ВсеЗаписиОбъемов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксРегистраторОбъемов КАК ВТ_МаксРегистраторОбъемов
	|		ПО ВТ_ВсеЗаписиОбъемов.Период = ВТ_МаксРегистраторОбъемов.Период
	|			И ВТ_ВсеЗаписиОбъемов.Регистратор = ВТ_МаксРегистраторОбъемов.Регистратор
	|			И ВТ_ВсеЗаписиОбъемов.Услуга = ВТ_МаксРегистраторОбъемов.Услуга
	|			И ВТ_ВсеЗаписиОбъемов.Месяц = ВТ_МаксРегистраторОбъемов.Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	Год,
	|	МесяцЧислом
	|ИТОГИ ПО
	|	Услуга,
	|	Год";
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Пакет = Запрос.ВыполнитьПакет();
	
	// данные по объекту
	СтруктураОбъекта = Новый Структура("НаименованиеОбъектаРасчета,МКД,НазначениеНП,КатегорияОбъекта,Площадь,ГруппаПотребителей,Участвует,ТемператураВнутриПомещения, АдресОбъекта, АдресОбъектаЗначение,Контролер,Помещение,Организация,ГруппаОбъектовРасчета, НаружныйОбъемЗдания");
	Результат = Пакет[Пакет.Количество()-4].Выбрать();
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Результат);
		
		Если ЗначениеЗаполнено(СтруктураОбъекта.АдресОбъектаЗначение) Тогда
			ОбъектКИ = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияВСтруктуруJSON(СтруктураОбъекта.АдресОбъектаЗначение, Перечисления.ТипыКонтактнойИнформации.Адрес);
			СтруктураОбъекта.АдресОбъектаЗначение = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ОбъектКИ);
		КонецЕсли;
	КонецЕсли;
	
	// данные по нагрузкам
	СоответствиеНагрузок = Новый Соответствие;
	Результат = Пакет[Пакет.Количество()-3].Выбрать();
	Пока Результат.Следующий() Цикл
		СоответствиеНагрузок.Вставить(Результат.Услуга, Результат.Нагрузка);
	КонецЦикла;
	
	// данные по потребителям ГВС
	СоответствиеПотребителей = Новый Соответствие;
	Результат = Пакет[Пакет.Количество()-2].Выбрать();
	Пока Результат.Следующий() Цикл
		СтруктураПотребителей = Новый Структура("Количество,КоличествоРабочихЧасовВДень,ТипНормы");
		ЗаполнитьЗначенияСвойств(СтруктураПотребителей, Результат);
		СоответствиеПотребителей.Вставить(Результат.Тип, СтруктураПотребителей);
	КонецЦикла;
	
	// данные по тарифным категориям
	СоответствиеТарифныхКатегорий = Новый Соответствие;
	Результат = Пакет[Пакет.Количество()-6].Выбрать();
	Пока Результат.Следующий() Цикл
		СоответствиеТарифныхКатегорий.Вставить(Результат.Услуга, Результат.ТарифнаяКатегория);
	КонецЦикла;

	
	// данные по объемам
	МассивОбъемов			= Новый Массив;
	МассивМесяцев			= Новый Массив;
	МассивМесяцев.Добавить("Январь");	МассивМесяцев.Добавить("Февраль");	МассивМесяцев.Добавить("Март");
	МассивМесяцев.Добавить("Апрель");	МассивМесяцев.Добавить("Май");		МассивМесяцев.Добавить("Июнь");
	МассивМесяцев.Добавить("Июль");		МассивМесяцев.Добавить("Август");	МассивМесяцев.Добавить("Сентябрь");
	МассивМесяцев.Добавить("Октябрь");	МассивМесяцев.Добавить("Ноябрь");	МассивМесяцев.Добавить("Декабрь");
	
	РезультатУслуга = Пакет[Пакет.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока РезультатУслуга.Следующий() Цикл 
		РезультатГод = РезультатУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатГод.Следующий() Цикл
			СтруктураОбъема	= Новый Структура("Год,Услуга,Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь");
			ЗаполнитьЗначенияСвойств(СтруктураОбъема, РезультатГод);
			Результат = РезультатГод.Выбрать();
			Пока Результат.Следующий() Цикл
				СтруктураОбъема[МассивМесяцев[Результат.МесяцЧислом-1]] = Результат.ОбъемУслуги;
			КонецЦикла;
			МассивОбъемов.Добавить(СтруктураОбъема);
		КонецЦикла;
	КонецЦикла;
	
	// данные по потерям
	МассивОбъемовПотерь		= Новый Массив;
	МассивМесяцевПотерь		= Новый Массив;
	МассивМесяцевПотерь.Добавить("Январь");	МассивМесяцевПотерь.Добавить("Февраль");	МассивМесяцевПотерь.Добавить("Март");
	МассивМесяцевПотерь.Добавить("Апрель");	МассивМесяцевПотерь.Добавить("Май");		МассивМесяцевПотерь.Добавить("Июнь");
	МассивМесяцевПотерь.Добавить("Июль");		МассивМесяцевПотерь.Добавить("Август");	МассивМесяцевПотерь.Добавить("Сентябрь");
	МассивМесяцевПотерь.Добавить("Октябрь");	МассивМесяцевПотерь.Добавить("Ноябрь");	МассивМесяцевПотерь.Добавить("Декабрь");
	
	РезультатУслуга = Пакет[Пакет.Количество()-5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока РезультатУслуга.Следующий() Цикл 
		РезультатГод = РезультатУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатГод.Следующий() Цикл
			СтруктураОбъема	= Новый Структура("Год,Услуга,Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь");
			ЗаполнитьЗначенияСвойств(СтруктураОбъема, РезультатГод);
			Результат = РезультатГод.Выбрать();
			Пока Результат.Следующий() Цикл
				СтруктураОбъема[МассивМесяцевПотерь[Результат.МесяцЧислом-1]] = Результат.ОбъемУслуги;
			КонецЦикла;
			МассивОбъемовПотерь.Добавить(СтруктураОбъема);
		КонецЦикла;
	КонецЦикла;

	
	СтруктураРезультат = Новый Структура("СтруктураОбъекта,СоответствиеНагрузок,СоответствиеПотребителей,МассивОбъемов, МассивПотерь, СоответствиеТарифныхКатегорий",СтруктураОбъекта,СоответствиеНагрузок,СоответствиеПотребителей,МассивОбъемов,МассивОбъемовПотерь, СоответствиеТарифныхКатегорий);
	Возврат СтруктураРезультат;
КонецФункции

// Функция - Вернуть адрес объекта расчета
//
// Параметры:
//  ОбъектРасчета - СправочникСсылка.бестОбъектыРасчета - объект расчета
// Возвращаемое значение:
//	Представление
//
Функция ВернутьАдресОбъектаРасчета(ОбъектРасчета) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ОбъектРасчета, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);	
	
КонецФункции

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьРеквизитыОбъектаРасчета(ОбъектРасчетаОбъект,ДанныеОбъектаРасчета)
	
	Если ДанныеОбъектаРасчета.Свойство("Наименование") Тогда 
		ОбъектРасчетаОбъект.Наименование					= ДанныеОбъектаРасчета.Наименование;
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("НазначениеНП") Тогда 
		ОбъектРасчетаОбъект.НазначениеНП					= ДанныеОбъектаРасчета.НазначениеНП;
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("ГруппаОбъектовРасчета") Тогда 
		ОбъектРасчетаОбъект.ГруппаОбъектовРасчета			= ДанныеОбъектаРасчета.ГруппаОбъектовРасчета;
	КонецЕсли;

	Если ДанныеОбъектаРасчета.Свойство("КатегорияОбъекта") Тогда 
		ОбъектРасчетаОбъект.КатегорияПомещения				= ДанныеОбъектаРасчета.КатегорияОбъекта;
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("МКД") Тогда 
		ОбъектРасчетаОбъект.МКД								= ДанныеОбъектаРасчета.МКД;
		Если ЗначениеЗаполнено(ОбъектРасчетаОбъект.МКД) Тогда
			ОбъектРасчетаОбъект.Строение						= ДанныеОбъектаРасчета.МКД;	
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("Помещение") Тогда 
		ОбъектРасчетаОбъект.Помещение						= ДанныеОбъектаРасчета.Помещение;
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("Контролер") Тогда 
		ОбъектРасчетаОбъект.Контролер						= ДанныеОбъектаРасчета.Контролер;
	КонецЕсли;
	
	Если ДанныеОбъектаРасчета.Свойство("Организация") Тогда 
		ОбъектРасчетаОбъект.Организация						= ДанныеОбъектаРасчета.Организация;
	КонецЕсли;
	
	СтрокиКИ												= ОбъектРасчетаОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.Адрес,Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета));
	Для Каждого СтрокаКИ Из СтрокиКИ Цикл
		ОбъектРасчетаОбъект.КонтактнаяИнформация.Удалить(СтрокаКИ); 
	КонецЦикла;

	Если ДанныеОбъектаРасчета.Свойство("МКД") и ЗначениеЗаполнено(ДанныеОбъектаРасчета.МКД) Тогда 
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектРасчетаОбъект, ДанныеОбъектаРасчета.МКД.Наименование, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);  
	ИначеЕсли ДанныеОбъектаРасчета.Свойство("АдресОбъектаЗначение") Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектРасчетаОбъект, ДанныеОбъектаРасчета.АдресОбъектаЗначение, Справочники.ВидыКонтактнойИнформации.АдресОбъектаРасчета);  
	КонецЕсли;
	
	Попытка	
		ОбъектРасчетаОбъект.Записать();
		Возврат ОбъектРасчетаОбъект.Ссылка;
	Исключение
		ОписаниеОшибки  				= ИнформацияОбОшибке();
		ВызватьИсключение "Не удалось создать объект расчета";
	КонецПопытки;
	
КонецФункции

Функция ДанныеОбъектаИзСтрокиJSON(ОписаниеОбъекта)
			
	Чтение  			= Новый ЧтениеJSON;	
	Чтение.УстановитьСтроку(ОписаниеОбъекта);
	ДанныеОбъекта 			= ПрочитатьJSON(Чтение);
	
	Результат 			= Новый Структура;	
	
	Если ДанныеОбъекта.Свойство("Наименование") Тогда
		Результат.Вставить("Наименование", 					Строка(ДанныеОбъекта.Наименование));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("НазначениеНП") Тогда
		Результат.Вставить("НазначениеНП", 					Справочники.бестНазначениеНежилогоПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.НазначениеНП)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("ГруппаОбъектовРасчета") Тогда
		Результат.Вставить("ГруппаОбъектовРасчета", 			Справочники.бестГруппыОбъектовРасчета.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.ГруппаОбъектовРасчета)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("КатегорияОбъекта") Тогда
		Результат.Вставить("КатегорияОбъекта", 				Справочники.энргКатегорииПомещений.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.КатегорияОбъекта)));
	КонецЕсли;

	Если ДанныеОбъекта.Свойство("МКД") Тогда
		Результат.Вставить("МКД", 					Справочники.энргСтроения.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.МКД)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("Помещение") Тогда
		Результат.Вставить("Помещение", 			Справочники.энргПомещения.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.Помещение)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("Контролер") Тогда
		Результат.Вставить("Контролер", 			Справочники.энргСотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.Контролер)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("Организация") Тогда
		Результат.Вставить("Организация", 			Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.Организация)));
	КонецЕсли;

	Если ДанныеОбъекта.Свойство("Договор") Тогда
		Результат.Вставить("Договор", 			Справочники.энргДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеОбъекта.Договор)));
	КонецЕсли;
	
	Если ДанныеОбъекта.Свойство("АдресОбъекта") Тогда
		Результат.Вставить("АдресОбъекта", 						ДанныеОбъекта.АдресОбъекта);
		Результат.Вставить("АдресОбъектаЗначение", 				ДанныеОбъекта.АдресОбъектаЗначение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьПериодВСтруктуру(ПорядковыйНомерМесяца, ОбъемПотерь, ОбъемыПотерьПоМесяцам)
	
	Если ПорядковыйНомерМесяца = 1 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Январь", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 2 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Февраль", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 3 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Март", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 4 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Апрель", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 5 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Май", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 6 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Июнь", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 7 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Июль", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 8 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Август", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 9 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Сентябрь", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 10 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Октябрь", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 11 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Ноябрь", ОбъемПотерь);
	ИначеЕсли ПорядковыйНомерМесяца = 12 Тогда
		ОбъемыПотерьПоМесяцам.Вставить("Декабрь", ОбъемПотерь);
	КонецЕсли;
	
	Возврат ОбъемыПотерьПоМесяцам;

КонецФункции

#КонецОбласти
